---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArrayIterator.#ctor
source: html/1ac57ab3-92a9-392e-41f6-25c43dbd9e15.htm
---
# Autodesk.Revit.DB.CombinableElementArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CombinableElementArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.